app/Models/UserModel.php

SELECT *
FROM `user`
WHERE `email` = 'admin@demo.com'
 LIMIT 1
---
    public function findByEmail($email)
    {
        return $this->where('email', $email)
                    ->first();