app/Libraries/Authentication.php

    public function getCurrentUser()
    {
        if ( ! $this->isLoggedIn()) {

            return null;

        }

        if ($this->user === null) {

            $model = new \App\Models\UserModel;

            $this->user = $model->find(session()->get('user_id'));
---
SELECT *
FROM `user`
WHERE `user`.`id` = '2'